Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ПеремещениеТоваров"); //Указываем документ к которому делаем внешнюю печ. форму
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); 	
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ПротоколСогласованияЦен"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0");       
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Протокол согласования цен", "ПротоколСогласованияЦен", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;  
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПротоколСогласованияЦен", "Протокол согласования цен", СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));
	
КонецПроцедуры // Печать()

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ПолеСлева 				= 5;
	ДокументРезультат.ПолеСправа 				= 5;
	ДокументРезультат.РазмерКолонтитулаСверху 	= 0;
	ДокументРезультат.РазмерКолонтитулаСнизу 	= 0;
	ДокументРезультат.АвтоМасштаб 				= Истина;
	ДокументРезультат.ОриентацияСтраницы 		= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_PhErpПротоколСогласованияЦен";
	
	
	МакетОбработки = ПолучитьМакет("ПФ_MXL_ПротоколСогласованияЦен");
	
	
	ДанныеДляПечати = ДанныеДляПечатиПеремещение(МассивОбъектов);
	Если ДанныеДляПечати.Количество() = 0 Тогда
		Возврат ДокументРезультат;
	КонецЕсли; 
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = МакетОбработки.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	МассивВыводимыхОбластей = Новый Массив;
	
	
	
	ОбластьШапка.Параметры.Заполнить(ДанныеДляПечати[0]);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы); 
	НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
	Для Каждого СтрокаТовары Из ДанныеДляПечати Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаТовары);
		
		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(СтрокаТовары);
		Если Не ПроверитьВыводТабличногоДокумента(ДокументРезультат, МассивВыводимыхОбластей) Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
		КонецЕсли;
		// Размер в процентах
		ЦенаМин = Мин(СтрокаТовары.ЦенаГРЛС, СтрокаТовары.ФактЦенаПроизводителяБезНДС);  
		
		Цена    = 0;   
		
		Если СтрокаТовары.ЦенаГРЛС = 0 Тогда
			Цена = СтрокаТовары.ФактЦенаПроизводителяБезНДС;
		ИначеЕсли СтрокаТовары.ФактЦенаПроизводителяБезНДС = 0 Тогда
			Цена = СтрокаТовары.ЦенаГРЛС;   
		Иначе 
			Цена = ЦенаМин;
		КонецЕсли;  
		
		Если Цена <> 0 Тогда
			ОкрЦена = Окр((СтрокаТовары.ЦенаБезНДС / Цена) - 1,4);
		Иначе
			ОкрЦена = 0;
		КонецЕсли;
		
		Процент = 0;
		Если СтрокаТовары.ЦенаГРЛС > 0 Тогда
			Процент = ОкрЦена * 100;
		КонецЕсли;   
		
		// Размер в рублях
		ЦенаВРуб = 0;
		Если СтрокаТовары.ЦенаГРЛС > 0 Тогда
			ЦенаВРуб = СтрокаТовары.ЦенаБезНДС - Цена;
		КонецЕсли;  
		
		Если Процент = 0  Тогда 
			ОбластьСтрока.Параметры.РазмерВПроцентах 	= "--";
		Иначе					
			ОбластьСтрока.Параметры.РазмерВПроцентах 	= Процент;
		КонецЕсли; 
		
		Если ЦенаВРуб = 0 Тогда
			ОбластьСтрока.Параметры.РазмерВРублях 		= "--";
		Иначе					
			ОбластьСтрока.Параметры.РазмерВРублях 		= ЦенаВРуб;
		КонецЕсли;
		
		
		ДокументРезультат.Вывести(ОбластьСтрока);	
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеДляПечати[0]);
	ДокументРезультат.Вывести(ОбластьПодвал); 
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, МассивОбъектов.Ссылка);

	
	
	
	Возврат ДокументРезультат;
	
	
КонецФункции  


Функция ПроверитьВыводТабличногоДокумента(ТабДок, ВыводимыеОбласти, РезультатПриОшибке = Истина)
	
	Попытка
		Возврат ТабДок.ПроверитьВывод(ВыводимыеОбласти);
	Исключение
		Возврат РезультатПриОшибке;
	КонецПопытки;
	
КонецФункции

Функция ДанныеДляПечатиПеремещение(МассивОбъектов)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.Организация.НаименованиеПолное КАК Отправитель,
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК НомерПеремещения,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК МНН,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Серия.PhErpGTIN КАК GTIN,
	|	ПеремещениеТоваровТовары.Серия.PhErpGTIN.Производитель КАК Производитель,
	|	ПеремещениеТоваровТовары.Серия.PhErpСерияПроизводителя КАК Серия,
	|	ПеремещениеТоваровТовары.Серия.PhErpФактическаяЦенаПроизводителя КАК ФактЦенаПроизводителяБезНДС,
	|	ПеремещениеТоваровТовары.Серия.PhErpФактическаяЦенаПроизводителя КАК ФактЦенаПроизводителя,
	|	ПеремещениеТоваровТовары.Серия.PhErpДатаРеализации КАК ДатаРеализации,
	|	ПеремещениеТоваровТовары.Серия.PhErpФактическаяЦенаПроизводителя КАК ЦенаБезНДС,
	|	ПеремещениеТоваровТовары.Серия.PhErpФактическаяЦенаПроизводителя КАК Цена,
	|	ЕСТЬNULL(PhErpФармаЦенообразованиеСрезПоследних.ЦенаГРЛС, 0) КАК ЦенаГРЛС,
	|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.ОрганизацияПолучатель.НаименованиеПолное КАК Получатель,
	|	ПеремещениеТоваровТовары.Ссылка.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВтТаблица1
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""PhErp_Нм_МеждународноеНепатентованноеНазвание"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты1
	|		ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты1.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты1.Свойство.Имя = ""PhErp_Нм_ЖНВЛП"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.PhErpФармаЦенообразование.СрезПоследних КАК PhErpФармаЦенообразованиеСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Серия.PhErpGTIN = PhErpФармаЦенообразованиеСрезПоследних.GTIN
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &МассивОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТаблица1.Отправитель КАК Отправитель,
	|	ВтТаблица1.НомерПеремещения КАК НомерПеремещения,
	|	ВтТаблица1.МНН КАК МНН,
	|	ВтТаблица1.Номенклатура КАК Номенклатура,
	|	ВтТаблица1.GTIN КАК GTIN,
	|	ВтТаблица1.Производитель КАК Производитель,
	|	ВтТаблица1.Серия КАК Серия,
	|	ВтТаблица1.ФактЦенаПроизводителяБезНДС КАК ФактЦенаПроизводителяБезНДС,
	|	ВтТаблица1.ФактЦенаПроизводителя КАК ФактЦенаПроизводителя,
	|	ВтТаблица1.ДатаРеализации КАК ДатаРеализации,
	|	ВтТаблица1.ЦенаБезНДС КАК ЦенаБезНДС,
	|	ВтТаблица1.Цена КАК Цена,
	|	ВтТаблица1.ЦенаГРЛС КАК ЦенаГРЛС,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВтТаблица1.ЦенаГРЛС > 0
	|					ТОГДА ОКР(ВтТаблица1.ЦенаБезНДС / ВЫБОР
	|								КОГДА ВтТаблица1.ЦенаГРЛС = 0
	|									ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС = 0
	|											ТОГДА ВтТаблица1.ЦенаГРЛС
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВтТаблица1.ЦенаГРЛС > ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|													ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|												ИНАЧЕ ВтТаблица1.ЦенаГРЛС
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ, 4) - 1
	|				ИНАЧЕ 0
	|			КОНЕЦ > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВтТаблица1.ЦенаГРЛС > 0
	|						ТОГДА ОКР(ВтТаблица1.ЦенаБезНДС / ВЫБОР
	|									КОГДА ВтТаблица1.ЦенаГРЛС = 0
	|										ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС = 0
	|												ТОГДА ВтТаблица1.ЦенаГРЛС
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ВтТаблица1.ЦенаГРЛС > ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|														ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|													ИНАЧЕ ВтТаблица1.ЦенаГРЛС
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ, 4) - 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ""--""
	|	КОНЕЦ КАК РазмерВПроцентах,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВтТаблица1.ЦенаГРЛС > 0
	|					ТОГДА ВтТаблица1.ЦенаБезНДС - ВЫБОР
	|							КОГДА ВтТаблица1.ЦенаГРЛС = 0
	|								ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС = 0
	|										ТОГДА ВтТаблица1.ЦенаГРЛС
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВтТаблица1.ЦенаГРЛС > ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|												ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|											ИНАЧЕ ВтТаблица1.ЦенаГРЛС
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВтТаблица1.ЦенаГРЛС > 0
	|						ТОГДА ВтТаблица1.ЦенаБезНДС - ВЫБОР
	|								КОГДА ВтТаблица1.ЦенаГРЛС = 0
	|									ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС = 0
	|											ТОГДА ВтТаблица1.ЦенаГРЛС
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВтТаблица1.ЦенаГРЛС > ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|													ТОГДА ВтТаблица1.ФактЦенаПроизводителяБезНДС
	|												ИНАЧЕ ВтТаблица1.ЦенаГРЛС
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ""--""
	|	КОНЕЦ КАК РазмерВРублях,
	|	ВтТаблица1.Ссылка КАК Ссылка,
	|	ВтТаблица1.Получатель КАК Получатель,
	|	ВтТаблица1.Руководитель КАК Руководитель
	|ИЗ
	|	ВтТаблица1 КАК ВтТаблица1";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции


