Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Справочник.Сотрудники");
	МассивНазначений.Добавить("Документ.Увольнение"); //Указываем документ к которому делаем внешнюю печ. форму
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); 	
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ПриказОбУвольнении"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0");       
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Приказ об увольнении АО Фармимэкс Т-8", "ПриказОбУвольнении", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;  
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриказОбУвольнении", "Приказ об увольнении АО Фармимэкс Т-8", СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));
	
КонецПроцедуры // Печать()

Функция СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати)Экспорт
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("ПФ_MXL_Т8");
	
	СписокПриказов = Новый Массив;
	МассивСотрудников = Новый Массив; 
	Если ТипЗнч(СсылкаНаДокумент) = Тип("СправочникСсылка.Сотрудники") Тогда
		МассивСотрудников.Добавить(СсылкаНаДокумент);
		ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина,МассивСотрудников , "ПриказОбУвольнении");
		Для Каждого ДанныеСотрудника Из ДанныеСотрудников Цикл
			Если ЗначениеЗаполнено(ДанныеСотрудника.ПриказОбУвольнении) Тогда
				СписокПриказов.Добавить(ДанныеСотрудника.ПриказОбУвольнении);
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru='По сотруднику %1 не найден приказ об увольнении'"), ДанныеСотрудника.Сотрудник);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеСотрудника.Сотрудник);   
				Возврат ТабличныйДокумент;
			КонецЕсли; 	
		КонецЦикла;
	Иначе
		СписокПриказов.Добавить(СсылкаНаДокумент);	
		МассивСотрудников.Добавить(СсылкаНаДокумент.Сотрудник);
	КонецЕсли;
	
	ОснованиеДляУволненияВидДокумента  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя",
		"PhZup_ОснованиеВидДокумента");
    ДатаПодачиЗаявления  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя",
		"PhZup_ДатаЗаявления");
    ПодписантКадровыхДокументов1  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя",
		"PhZup_Подписант1");
    ПодписантКадровыхДокументов2  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя",
		"PhZup_Подписант2");
    ПодписантКадровыхДокументов3  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя",
		"PhZup_Подписант3");


	
	
	ТЗ = ПолучитьПараметрыМакета(СписокПриказов,МассивСотрудников);
	
	//Шапка
	Шапка = МакетОбработки.ПолучитьОбласть("Шапка");
	Шапка.Параметры.РаботаОрганизацияНаименованиеСокращенное = ТЗ[0].ОрганизацияНаименованиеСокращенное;
	Шапка.Параметры.СсылкаНаОбъектДата = ТЗ[0].СсылкаНаОбъектДата;
	Шапка.Параметры.СсылкаНаОбъектНомерНаПечать = ТЗ[0].СсылкаНаОбъектНомер;
	ТабличныйДокумент.Вывести(Шапка);
	
	//работник
	Работник = МакетОбработки.ПолучитьОбласть("Работник");
	Работник.Параметры.РаботаТрудовойДоговорДатаОформленияНаПечать = ТЗ[0].ДатаДоговораКонтракта;
	Работник.Параметры.РаботаТрудовойДоговорНомер                  = ТЗ[0].НомерДоговораКонтракта; 
	Если ТЗ[0].Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
		Работник.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = СклонениеПредставленийОбъектов.ПросклонятьФИО(ТЗ[0].ФИОПолные,4,,1); 
	Иначе
		Работник.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = СклонениеПредставленийОбъектов.ПросклонятьФИО(ТЗ[0].ФИОПолные,4,,2);
	КонецЕсли;

	Работник.Параметры.РаботаПодразделениеНаПечать  =    ТЗ[0].Подразделение;                                
	Работник.Параметры.РаботаДолжность             =     ТЗ[0].Должность;
	//Работник.Параметры.РаботаРазрядКатегорияНаПечать =	
	Работник.Параметры.ОснованиеДляУволненияВидДокумента  = УправлениеСвойствами.ЗначениеСвойства(СписокПриказов[0], ОснованиеДляУволненияВидДокумента); 
    Работник.Параметры.ДатаПодачиЗаявления	      =  Формат(УправлениеСвойствами.ЗначениеСвойства(СписокПриказов[0], ДатаПодачиЗаявления),"ДФ=dd.MM.yyyy");
	Работник.Параметры.РаботаОснованиеУвольнения    =  ТЗ[0].ОснованиеУвольнения;
	ТабличныйДокумент.Вывести(Работник);  
	
	//Подвал
	Подвал = МакетОбработки.ПолучитьОбласть("Подвал"); 
	Подвал.Параметры.СсылкаНаОбъектДолжностьРуководителя = ТЗ[0].СсылкаНаОбъектДолжностьРуководителя ;
	Подвал.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи =ТЗ[0].РуководительРасшифровкаПодписи ;
    Подвал.Параметры.ПодписантКадровыхДокументов1 = УправлениеСвойствами.ЗначениеСвойства(СписокПриказов[0].Организация, ПодписантКадровыхДокументов1);
    Подвал.Параметры.ПодписантКадровыхДокументов2 = УправлениеСвойствами.ЗначениеСвойства(СписокПриказов[0].Организация, ПодписантКадровыхДокументов2);
	Подвал.Параметры.ПодписантКадровыхДокументов3 = УправлениеСвойствами.ЗначениеСвойства(СписокПриказов[0].Организация, ПодписантКадровыхДокументов3);
    //Подвал.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника =  ;
	ТабличныйДокумент.Вывести(Подвал); 
	
	                       	
		
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции  


Функция ПолучитьПараметрыМакета(СписокПриказов,Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СсылкиНаОбъекты", СписокПриказов);
	Запрос.УстановитьПараметр("П2", Тип("Неопределено"));
	Запрос.УстановитьПараметр("П", Сотрудник[0]);
	
	Запрос.Текст = "       ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Увольнение.Ссылка КАК СсылкаНаОбъект,
	|	Увольнение.ДатаУвольнения КАК Период,
	|	Увольнение.Сотрудник КАК Сотрудник,
	|	Увольнение.СтатьяТКРФ КАК СтатьяТКРФ,
	|	Увольнение.ОснованиеУвольнения КАК ОснованиеУвольнения
	|ПОМЕСТИТЬ ВТСсылкиНаДокумент
	|ИЗ
	|	Документ.Увольнение КАК Увольнение
	|ГДЕ
	|	Увольнение.Ссылка В(&СсылкиНаОбъекты)
	|	И Увольнение.Сотрудник В (&П)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УвольнениеСпискомСотрудники.Ссылка,
	|	УвольнениеСпискомСотрудники.ДатаУвольнения,
	|	УвольнениеСпискомСотрудники.Сотрудник,
	|	УвольнениеСпискомСотрудники.СтатьяТКРФ,
	|	УвольнениеСпискомСотрудники.ОснованиеУвольнения
	|ИЗ
	|	Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
	|ГДЕ
	|	УвольнениеСпискомСотрудники.Ссылка В(&СсылкиНаОбъекты)
	|	И УвольнениеСпискомСотрудники.Сотрудник В (&П)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.Сотрудник КАК Сотрудник,
	|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫРАЗИТЬ(ТаблицаОтборов.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудникТаблицыРазличных,
	|	СправочникСотрудники.Код КАК ТАБЕЛЬНЫЙНОМЕР
	|ПОМЕСТИТЬ ВТОтборовРазличныхСотрудников
	|ИЗ
	|	ВТСсылкиНаДокумент КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
	|		ПО ТаблицаОтборов.Сотрудник = СправочникСотрудники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведений.Сотрудник КАК Сотрудник,
	|	ИзмеренияДаты.Период КАК Период
	|ПОМЕСТИТЬ ВТСведенияОРабочихМестахСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудниковИнтервальный КАК РегистрСведений
	|		ПО (РегистрСведений.ДатаНачала <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.ДатаОкончания >= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.Сотрудник КАК Сотрудник,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.Сотрудник,
	|	РегистрСведений.ФизическоеЛицо,
	|	РегистрСведений.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.Сотрудник КАК Сотрудник,
	|	РегистрСведений.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	РегистрСведений.НомерДоговораКонтракта КАК НомерДоговораКонтракта
	|ПОМЕСТИТЬ ВТОсновныеДанныеКонтрактовДоговоровСотрудников
	|ИЗ
	|	ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.Сотрудник = РегистрСведений.Сотрудник
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|			И МаксимальныеПериоды.ГоловнаяОрганизация = РегистрСведений.ГоловнаяОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмеренияДаты.Сотрудник КАК Сотрудник,
	|	ИзмеренияДаты.Период КАК Период,
	|	РегистрСведений.Организация КАК Организация,
	|	РегистрСведений.Подразделение КАК Подразделение,
	|	РегистрСведений.Должность КАК Должность
	|ПОМЕСТИТЬ ВТСведенияКадровойИсторииСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК РегистрСведений
	|		ПО (РегистрСведений.ДатаНачала <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.ДатаОкончания >= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.Сотрудник.ФизическоеЛицо)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ИзмеренияДаты.Период
	|			КОНЕЦ)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.Фамилия КАК Фамилия,
	|	РегистрСведений.Имя КАК Имя,
	|	РегистрСведений.Отчество КАК Отчество
	|ПОМЕСТИТЬ ВТСведенияОФИОФизическихЛиц
	|ИЗ
	|	ВТПериодыСрезаФИОФизическихЛиц КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудников.Организация КАК Организация,
	|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудников.Должность КАК Должность,
	|	ТаблицаОтборов.ТАБЕЛЬНЫЙНОМЕР КАК ТАБЕЛЬНЫЙНОМЕР,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеГоловныхСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДАТАУВОЛЬНЕНИЯ,
	|	ВЫБОР
	|		КОГДА СведенияОФИОФизическихЛиц.Фамилия ЕСТЬ NULL
	|			ТОГДА СправочникФизическиеЛица.ФИО
	|		ИНАЧЕ СведенияОФИОФизическихЛиц.Фамилия + ВЫБОР
	|				КОГДА СведенияОФИОФизическихЛиц.Имя = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" "" + СведенияОФИОФизическихЛиц.Имя
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СведенияОФИОФизическихЛиц.Отчество = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" "" + СведенияОФИОФизическихЛиц.Отчество
	|			КОНЕЦ
	|	КОНЕЦ КАК ФИОПОЛНЫЕ,
	|	СправочникФизическиеЛица.Пол КАК ПОЛ,
	|	ОсновныеДанныеКонтрактовДоговоровСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	ОсновныеДанныеКонтрактовДоговоровСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта
	|ПОМЕСТИТЬ ПредставленияКадровыеДанныеСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеГоловныхСотрудников
	|		ПО ТаблицаОтборов.ГоловнойСотрудникТаблицыРазличных = ТекущиеКадровыеДанныеГоловныхСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СправочникФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОФИОФизическихЛиц КАК СведенияОФИОФизическихЛиц
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СведенияОФИОФизическихЛиц.ФизическоеЛицо
	|			И ТаблицаОтборов.Период = СведенияОФИОФизическихЛиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадровойИсторииСотрудников КАК КадроваяИсторияСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = КадроваяИсторияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеДанныеКонтрактовДоговоровСотрудников КАК ОсновныеДанныеКонтрактовДоговоровСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = ОсновныеДанныеКонтрактовДоговоровСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = ОсновныеДанныеКонтрактовДоговоровСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОРабочихМестахСотрудников КАК СведенияОРабочихМестахСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = СведенияОРабочихМестахСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = СведенияОРабочихМестахСотрудников.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияКадровойИсторииСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтборовРазличныхСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеДанныеКонтрактовДоговоровСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОРабочихМестахСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДокумент.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
	|	СсылкиНаДокумент.Период КАК Период
	|ПОМЕСТИТЬ ВТОтветственныеЛица
	|ИЗ
	|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТОтборовРазличныхФизическихЛиц
	|ИЗ
	|	ВТОтветственныеЛица КАК ТаблицаОтборов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхФизическихЛиц КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ИзмеренияДаты.Период
	|			КОНЕЦ)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.Фамилия КАК Фамилия,
	|	РегистрСведений.Инициалы КАК Инициалы
	|ПОМЕСТИТЬ ВТСведенияОФИОФизическихЛиц
	|ИЗ
	|	ВТПериодыСрезаФИОФизическихЛиц КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(СведенияОФИОФизическихЛиц.Инициалы, СправочникФизическиеЛица.Инициалы) + "" "" + ЕСТЬNULL(СведенияОФИОФизическихЛиц.Фамилия, СправочникФизическиеЛица.Фамилия) КАК ИОФамилия
	|ПОМЕСТИТЬ ПредставленияКадровыеДанныеФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхФизическихЛиц КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОФИОФизическихЛиц КАК СведенияОФИОФизическихЛиц
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СведенияОФИОФизическихЛиц.ФизическоеЛицо
	|			И ТаблицаОтборов.Период = СведенияОФИОФизическихЛиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СправочникФизическиеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтборовРазличныхФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокумент.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ПредставленияКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ПредставленияКадровыеДанныеСотрудников.ДАТАУВОЛЬНЕНИЯ КАК ДатаУвольнения,
	|	ПредставленияКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
	|	ПредставленияКадровыеДанныеСотрудников.Должность КАК Должность,
	|	ПредставленияКадровыеДанныеСотрудников.ФИОПОЛНЫЕ КАК ФИОПолные,
	|	ПредставленияКадровыеДанныеСотрудников.ПОЛ КАК Пол,
	|	ПредставленияКадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	ПредставленияКадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
	|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
	|	СсылкиНаДокумент.СтатьяТКРФ КАК СтатьяТКРФ,
	|	СсылкиНаДокумент.ОснованиеУвольнения КАК ОснованиеУвольнения,
	|	ПредставленияКадровыеДанныеСотрудников.ТАБЕЛЬНЫЙНОМЕР КАК ТабельныйНомер,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	СсылкиНаДокумент.СсылкаНаОбъект.Дата КАК СсылкаНаОбъектДата,
	|	СсылкиНаДокумент.СсылкаНаОбъект.ДатаПервичногоДокумента КАК СсылкаНаОбъектДатаПервичногоДокумента,
	|	СсылкиНаДокумент.СсылкаНаОбъект.ДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
	|	СсылкиНаДокумент.СсылкаНаОбъект.Номер КАК СсылкаНаОбъектНомер,
	|	СсылкиНаДокумент.СсылкаНаОбъект.НомерПриказа КАК СсылкаНаОбъектНомерПриказа,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СсылкиНаДокумент.СсылкаНаОбъект) В (&П2)
	|			ТОГДА 1
	|		КОГДА СсылкиНаДокумент.СсылкаНаОбъект.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СсылкаНаОбъектПолеУпорядочивания1
	|ИЗ
	|	ВТСсылкиНаДокумент КАК СсылкиНаДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудников
	|		ПО СсылкиНаДокумент.Период = ПредставленияКадровыеДанныеСотрудников.Период
	|			И СсылкиНаДокумент.Сотрудник = ПредставленияКадровыеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредставленияКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО СсылкиНаДокумент.Период = КадровыеДанныеФизическихЛиц.Период
	|			И СсылкиНаДокумент.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредставленияОснованийУвольнения КАК ПредставленияОснованийУвольнения
	|		ПО СсылкиНаДокумент.СтатьяТКРФ = ПредставленияОснованийУвольнения.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	СсылкаНаОбъектПолеУпорядочивания1,
	|	СсылкаНаОбъектДата,
	|	СсылкаНаОбъект";
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
КонецФункции
