
&НаСервере
Функция  Команда1НаСервере()
	// Вставить содержимое обработчика.  	
	ПараметрыПечати  = Новый Структура;
	ОбъектыПечати    = Новый СписокЗначений;
	МассивОбъектов   = Новый Массив();
	МассивОбъектов.Добавить(Реквизит1);
	Обработка        = РеквизитФормыВЗначение("Объект");
	СсылкаНаДокумент = Реквизит1;
	ТабДок           = Обработка.СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати);

	Возврат ТабДок;

КонецФункции
&НаКлиенте
Процедура Команда1(Команда)
	  
	ТабДок = Команда1НаСервере();
	ТабДок.Показать();
КонецПроцедуры
