Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.УвольнениеСписком"); //Указываем документ к которому делаем внешнюю печ. форму
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); 	
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ПриказОбУвольненииСписком"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0");       
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Приказ об увольнении АО Фармимэкс (Т-8а)", "ПриказОбУвольненииСписком", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;  
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриказОбУвольненииСписком", "Приказ об увольнении АО Фармимэкс (Т-8а)", СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));
	
КонецПроцедуры // Печать()

Функция СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати)Экспорт
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	МакетОбработки = ПолучитьМакет("ПФ_MXL_Т8а");
	
	
	ОснованиеДляУволненияВидДокумента  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
	"Имя",
	"PhZup_ОснованиеВидДокумента");
	ДатаПодачиЗаявления  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
	"Имя",
	"PhZup_ДатаЗаявления");
	ПодписантКадровыхДокументов1  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
	"Имя",
	"PhZup_Подписант1");
	ПодписантКадровыхДокументов2  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
	"Имя",
	"PhZup_Подписант2");
	ПодписантКадровыхДокументов3  = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
	"Имя",
	"PhZup_Подписант3");
	
	
	       
	
	ТЗ = ПолучитьПараметрыМакета(СсылкаНаДокумент);
	
	//Шапка
	Шапка = МакетОбработки.ПолучитьОбласть("Шапка");
	Шапка.Параметры.РаботаОрганизацияНаименованиеСокращенное = ТЗ[0].ОрганизацияНаименованиеСокращенное;
	Шапка.Параметры.СсылкаНаОбъектДатаНаПечать = ТЗ[0].СсылкаНаОбъектДата;
	Шапка.Параметры.СсылкаНаОбъектНомерНаПечать = ТЗ[0].СсылкаНаОбъектНомерПриказа;
	ТабличныйДокумент.Вывести(Шапка);  
	
	ШапкаТаблицы = МакетОбработки.ПолучитьОбласть("ШапкаТаблицы");
	Строка = МакетОбработки.ПолучитьОбласть("Строка");
	Подвал = МакетОбработки.ПолучитьОбласть("Подвал"); 
	
	ТабличныйДокумент.Вывести(ШапкаТаблицы); 
	//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ПследняяСтрока = ТЗ.Количество();
	Счетчик = 0;
	
	Для Каждого СтрокаТЗ  Из ТЗ Цикл
	Счетчик = Счетчик + 1;	
	//ТабличныйДокумент.Вывести(ШапкаТаблицы); 
	Если СтрокаТЗ.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
		Строка.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрокаТЗ.ФИОПолные,4,,1); 
	Иначе
		Строка.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = СклонениеПредставленийОбъектов.ПросклонятьФИО(СтрокаТЗ.ФИОПолные,4,,2);
	КонецЕсли;
	Строка.Параметры.РаботаПодразделениеНаПечать = СтрокаТЗ.Подразделение;	
	Строка.Параметры.РаботаДолжность = СтрокаТЗ.Должность; 
	Строка.Параметры.ДатаПодачиЗаявления =  Формат(УправлениеСвойствами.ЗначениеСвойства(СтрокаТЗ.СсылкаНаОбъект, ДатаПодачиЗаявления),"ДФ=dd.MM.yyyy");
    Строка.Параметры.РаботаДатаУвольнения  = Формат(СтрокаТЗ.ДатаУвольнения,"ДФ=dd.MM.yyyy"); 
    Строка.Параметры.РаботаСтатьяТКРФНаПечать = СтрокаТЗ.СтатьяТКРФ;
	   
	Строка.Параметры.ОснованиеДляУвольненияСпискомВидДокумента  = УправлениеСвойствами.ЗначениеСвойства(СтрокаТЗ.СсылкаНаОбъект, ОснованиеДляУволненияВидДокумента);
	 
	
	ТабличныйДокумент.Вывести(Строка);  
	
	Если Счетчик = ПследняяСтрока Тогда
	Подвал.Параметры.СсылкаНаОбъектДолжностьРуководителя = ТЗ[0].СсылкаНаОбъектДолжностьРуководителя ;
	Подвал.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи = ТЗ[0].РуководительРасшифровкаПодписи ;
	Подвал.Параметры.ПодписантКадровыхДокументов1 = УправлениеСвойствами.ЗначениеСвойства(СсылкаНаДокумент.Организация, ПодписантКадровыхДокументов1);
	Подвал.Параметры.ПодписантКадровыхДокументов2 = УправлениеСвойствами.ЗначениеСвойства(СсылкаНаДокумент.Организация, ПодписантКадровыхДокументов2);
	Подвал.Параметры.ПодписантКадровыхДокументов3 = УправлениеСвойствами.ЗначениеСвойства(СсылкаНаДокумент.Организация, ПодписантКадровыхДокументов3);
	ТабличныйДокумент.Вывести(Подвал);	
	КонецЕсли;
	
	//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;
	
	
	
 
		
	Возврат ТабличныйДокумент;
	
	
КонецФункции  


Функция ПолучитьПараметрыМакета(СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СсылкиНаОбъекты", СсылкаНаДокумент );	
	Запрос.Текст = "ВЫБРАТЬ
	|	УвольнениеСпискомСотрудники.Ссылка КАК СсылкаНаОбъект,
	|	УвольнениеСпискомСотрудники.ДатаУвольнения КАК Период,
	|	УвольнениеСпискомСотрудники.Сотрудник КАК Сотрудник,
	|	УвольнениеСпискомСотрудники.СтатьяТКРФ КАК СтатьяТКРФ,
	|	УвольнениеСпискомСотрудники.ОснованиеУвольнения КАК ОснованиеУвольнения
	|ПОМЕСТИТЬ ВТСотрудникиДокумента
	|ИЗ
	|	Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
	|ГДЕ
	|	УвольнениеСпискомСотрудники.Ссылка В(&СсылкиНаОбъекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.Сотрудник КАК Сотрудник,
	|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫРАЗИТЬ(ТаблицаОтборов.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудникТаблицыРазличных,
	|	СправочникСотрудники.Код КАК ТАБЕЛЬНЫЙНОМЕР
	|ПОМЕСТИТЬ ВТОтборовРазличныхСотрудников
	|ИЗ
	|	ВТСотрудникиДокумента КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
	|		ПО ТаблицаОтборов.Сотрудник = СправочникСотрудники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведений.Сотрудник КАК Сотрудник,
	|	ИзмеренияДаты.Период КАК Период
	|ПОМЕСТИТЬ ВТСведенияОРабочихМестахСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РабочиеМестаСотрудниковИнтервальный КАК РегистрСведений
	|		ПО (РегистрСведений.ДатаНачала <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.ДатаОкончания >= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.Сотрудник КАК Сотрудник,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.Сотрудник,
	|	РегистрСведений.ФизическоеЛицо,
	|	РегистрСведений.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.Сотрудник КАК Сотрудник,
	|	РегистрСведений.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	РегистрСведений.НомерДоговораКонтракта КАК НомерДоговораКонтракта
	|ПОМЕСТИТЬ ВТОсновныеДанныеКонтрактовДоговоровСотрудников
	|ИЗ
	|	ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.Сотрудник = РегистрСведений.Сотрудник
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|			И МаксимальныеПериоды.ГоловнаяОрганизация = РегистрСведений.ГоловнаяОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаОсновныеДанныеКонтрактаДоговораСотрудника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмеренияДаты.Сотрудник КАК Сотрудник,
	|	ИзмеренияДаты.Период КАК Период,
	|	РегистрСведений.Организация КАК Организация,
	|	РегистрСведений.Подразделение КАК Подразделение,
	|	РегистрСведений.Должность КАК Должность
	|ПОМЕСТИТЬ ВТСведенияКадровойИсторииСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК РегистрСведений
	|		ПО (РегистрСведений.ДатаНачала <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.ДатаОкончания >= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, ДЕНЬ)
	|			КОНЕЦ)
	|			И (РегистрСведений.Сотрудник = ИзмеренияДаты.Сотрудник)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.Сотрудник.ФизическоеЛицо)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ИзмеренияДаты.Период
	|			КОНЕЦ)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.Фамилия КАК Фамилия,
	|	РегистрСведений.Имя КАК Имя,
	|	РегистрСведений.Отчество КАК Отчество
	|ПОМЕСТИТЬ ВТСведенияОФИОФизическихЛиц
	|ИЗ
	|	ВТПериодыСрезаФИОФизическихЛиц КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудников.Организация КАК Организация,
	|	КадроваяИсторияСотрудников.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудников.Должность КАК Должность,
	|	ТаблицаОтборов.ТАБЕЛЬНЫЙНОМЕР КАК ТАБЕЛЬНЫЙНОМЕР,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеГоловныхСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДАТАУВОЛЬНЕНИЯ,
	|	ВЫБОР
	|		КОГДА СведенияОФИОФизическихЛиц.Фамилия ЕСТЬ NULL
	|			ТОГДА СправочникФизическиеЛица.ФИО
	|		ИНАЧЕ СведенияОФИОФизическихЛиц.Фамилия + ВЫБОР
	|				КОГДА СведенияОФИОФизическихЛиц.Имя = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" "" + СведенияОФИОФизическихЛиц.Имя
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СведенияОФИОФизическихЛиц.Отчество = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" "" + СведенияОФИОФизическихЛиц.Отчество
	|			КОНЕЦ
	|	КОНЕЦ КАК ФИОПОЛНЫЕ,
	|	СправочникФизическиеЛица.Пол КАК ПОЛ,
	|	ОсновныеДанныеКонтрактовДоговоровСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	ОсновныеДанныеКонтрактовДоговоровСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта
	|ПОМЕСТИТЬ ПредставленияКадровыеДанныеСотрудников
	|ИЗ
	|	ВТОтборовРазличныхСотрудников КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеГоловныхСотрудников
	|		ПО ТаблицаОтборов.ГоловнойСотрудникТаблицыРазличных = ТекущиеКадровыеДанныеГоловныхСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СправочникФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОФИОФизическихЛиц КАК СведенияОФИОФизическихЛиц
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СведенияОФИОФизическихЛиц.ФизическоеЛицо
	|			И ТаблицаОтборов.Период = СведенияОФИОФизическихЛиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадровойИсторииСотрудников КАК КадроваяИсторияСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = КадроваяИсторияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеДанныеКонтрактовДоговоровСотрудников КАК ОсновныеДанныеКонтрактовДоговоровСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = ОсновныеДанныеКонтрактовДоговоровСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = ОсновныеДанныеКонтрактовДоговоровСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОРабочихМестахСотрудников КАК СведенияОРабочихМестахСотрудников
	|		ПО ТаблицаОтборов.Сотрудник = СведенияОРабочихМестахСотрудников.Сотрудник
	|			И ТаблицаОтборов.Период = СведенияОРабочихМестахСотрудников.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияКадровойИсторииСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтборовРазличныхСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеДанныеКонтрактовДоговоровСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОРабочихМестахСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиДокумента.СсылкаНаОбъект.Руководитель КАК ФизическоеЛицо,
	|	СотрудникиДокумента.Период КАК Период
	|ПОМЕСТИТЬ ВТОтветственныеЛица
	|ИЗ
	|	ВТСотрудникиДокумента КАК СотрудникиДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТОтборовРазличныхФизическихЛиц
	|ИЗ
	|	ВТОтветственныеЛица КАК ТаблицаОтборов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрСведений.Период) КАК Период,
	|	ИзмеренияДаты.Период КАК ЗаданныйПериод,
	|	РегистрСведений.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхФизическихЛиц КАК ИзмеренияДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период <= ВЫБОР
	|				КОГДА ИзмеренияДаты.Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ИзмеренияДаты.Период
	|			КОНЕЦ)
	|			И (РегистрСведений.ФизическоеЛицо = ИзмеренияДаты.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмеренияДаты.Период,
	|	РегистрСведений.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
	|	МаксимальныеПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрСведений.Фамилия КАК Фамилия,
	|	РегистрСведений.Инициалы КАК Инициалы
	|ПОМЕСТИТЬ ВТСведенияОФИОФизическихЛиц
	|ИЗ
	|	ВТПериодыСрезаФИОФизическихЛиц КАК МаксимальныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК РегистрСведений
	|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)
	|			И МаксимальныеПериоды.ФизическоеЛицо = РегистрСведений.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериодыСрезаФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(СведенияОФИОФизическихЛиц.Инициалы, СправочникФизическиеЛица.Инициалы) + "" "" + ЕСТЬNULL(СведенияОФИОФизическихЛиц.Фамилия, СправочникФизическиеЛица.Фамилия) КАК ИОФамилия
	|ПОМЕСТИТЬ ПредставленияКадровыеДанныеФизическихЛиц
	|ИЗ
	|	ВТОтборовРазличныхФизическихЛиц КАК ТаблицаОтборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОФИОФизическихЛиц КАК СведенияОФИОФизическихЛиц
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СведенияОФИОФизическихЛиц.ФизическоеЛицо
	|			И ТаблицаОтборов.Период = СведенияОФИОФизическихЛиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО ТаблицаОтборов.ФизическоеЛицо = СправочникФизическиеЛица.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтборовРазличныхФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОФИОФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиДокумента.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	ПредставленияКадровыеДанныеСотрудников.ДАТАУВОЛЬНЕНИЯ КАК ДатаУвольнения,
	|	ПредставленияКадровыеДанныеСотрудников.Организация КАК Организация,
	|	ПредставленияКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
	|	ПредставленияКадровыеДанныеСотрудников.Должность КАК Должность,
	|	ПредставленияКадровыеДанныеСотрудников.ФИОПОЛНЫЕ КАК ФИОПолные,
	|	ПредставленияКадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ДатаДоговораКонтракта,
	|	ПредставленияКадровыеДанныеСотрудников.НомерДоговораКонтракта КАК НомерДоговораКонтракта,
	|	КадровыеДанныеФизическихЛиц.ИОФамилия КАК РуководительРасшифровкаПодписи,
	|	СотрудникиДокумента.СтатьяТКРФ КАК СтатьяТКРФ,
	|	СотрудникиДокумента.ОснованиеУвольнения КАК ОснованиеУвольнения,
	|	ПредставленияКадровыеДанныеСотрудников.ПОЛ КАК Пол,
	|	ПредставленияКадровыеДанныеСотрудников.ТАБЕЛЬНЫЙНОМЕР КАК ТабельныйНомер,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	СотрудникиДокумента.СсылкаНаОбъект.Дата КАК СсылкаНаОбъектДата,
	|	СотрудникиДокумента.СсылкаНаОбъект.ДатаПервичногоДокумента КАК СсылкаНаОбъектДатаПервичногоДокумента,
	|	СотрудникиДокумента.СсылкаНаОбъект.ДолжностьРуководителя КАК СсылкаНаОбъектДолжностьРуководителя,
	|	СотрудникиДокумента.СсылкаНаОбъект.Номер КАК СсылкаНаОбъектНомер,
	|	СотрудникиДокумента.СсылкаНаОбъект.НомерПриказа КАК СсылкаНаОбъектНомерПриказа,
	|	ВЫБОР
	|		КОГДА СотрудникиДокумента.СсылкаНаОбъект.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СсылкаНаОбъектПолеУпорядочивания1,
	|	ВЫБОР
	|		КОГДА ПредставленияКадровыеДанныеСотрудников.Организация.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОрганизацияПолеУпорядочивания1,
	|	ПредставленияКадровыеДанныеСотрудников.Организация.Наименование КАК ОрганизацияПолеУпорядочивания2
	|ИЗ
	|	ВТСотрудникиДокумента КАК СотрудникиДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудников
	|		ПО СотрудникиДокумента.Период = ПредставленияКадровыеДанныеСотрудников.Период
	|			И СотрудникиДокумента.Сотрудник = ПредставленияКадровыеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредставленияКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО СотрудникиДокумента.Период = КадровыеДанныеФизическихЛиц.Период
	|			И СотрудникиДокумента.СсылкаНаОбъект.Руководитель = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредставленияОснованийУвольнения КАК ПредставленияОснованийУвольнения
	|		ПО СотрудникиДокумента.СтатьяТКРФ = ПредставленияОснованийУвольнения.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	СсылкаНаОбъектПолеУпорядочивания1,
	|	СсылкаНаОбъектДата,
	|	СсылкаНаОбъект,
	|	ОрганизацияПолеУпорядочивания1,
	|	ОрганизацияПолеУпорядочивания2,
	|	Организация";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции
