  Функция  СведенияОВнешнейОбработке()  Экспорт  
	  
	  
	  ПараметрыРегистрации = Новый Структура;
	  МассивНазначений = Новый Массив;
	  МассивНазначений.Добавить("Документ.ПриходныйОрдерНаТовары"); //Указываем документ к которому делаем внешнюю печ. форму
	  ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	  ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	  ПараметрыРегистрации.Вставить("Наименование", "Печатная форма стеллажная карточка"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	  ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	  ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	  ПараметрыРегистрации.Вставить("Информация", "Информация"); 
	  ТаблицаКоманд = ПолучитьТаблицуКоманд();
	  ДобавитьКоманду(ТаблицаКоманд, "Стеллажная карточка", "ПечатьСтеллажнаяКарточка", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	  ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	  
	  Возврат ПараметрыРегистрации;	
	  
  КонецФункции   
  
  
  Функция ПолучитьТаблицуКоманд()
	  
	  Команды = Новый ТаблицаЗначений;
	  Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ. формы для пользователя
	  Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	  Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	  Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	  Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	  Возврат Команды;  
	  
  КонецФункции
  
  Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	  
	  НоваяКоманда = ТаблицаКоманд.Добавить();
	  НоваяКоманда.Представление = Представление; 
	  НоваяКоманда.Идентификатор = Идентификатор;
	  НоваяКоманда.Использование = Использование;
	  НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	  НоваяКоманда.Модификатор = Модификатор;
	  
  КонецПроцедуры
  
  Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	  
	  УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьСтеллажнаяКарточка", "Печать стеллажная карточка", СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));
	  
  КонецПроцедуры // Печать()	  
  
  Функция СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати) Экспорт 	
	  
	//+Дмитрий@, 2024-10-31 01:16:30 LE-003 "Стеллажная карточка"
	  ТабличныйДокумент = Новый ТабличныйДокумент;
	  ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	  
	  МакетОбработки       = ПолучитьМакет("Макет");
	  ОбластьЗаголовок     = МакетОбработки.ПолучитьОбласть("Заголовок");
	  ОбластьШапка         = МакетОбработки.ПолучитьОбласть("Шапка");
	  ОбластьТаблица       = МакетОбработки.ПолучитьОбласть("Таблица");
	  ОбластьСтрокаТаблицы = МакетОбработки.ПолучитьОбласть("СтрокаТаблицы");
	  ОбластьПодвал        = МакетОбработки.ПолучитьОбласть("Подвал");
	  
	  Для Каждого стр Из СсылкаНаДокумент.товары Цикл
	      
	      ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	      ТабличныйДокумент.Вывести(ОбластьШапка);
	      ТабличныйДокумент.Вывести(ОбластьТаблица);
		  
		  ОбластьСтрокаТаблицы.Параметры.Артикул  = стр.номенклатура.Артикул;
	      ОбластьСтрокаТаблицы.Параметры.Номенклатура  = стр.номенклатура;
	      ОбластьСтрокаТаблицы.Параметры.Производитель = стр.Серия.PhErpGTIN.Производитель;
	      ОбластьСтрокаТаблицы.Параметры.Серия         = стр.Серия.PhErpСерияПроизводителя;
	      ОбластьСтрокаТаблицы.Параметры.СрокГодности  = Формат(стр.Серия.ГоденДо, "ДЛФ=Д");
	      // ОбластьСтрокаТаблицы.Параметры.Температура   = стр.номенклатура.складскаягруппа;
	      
	      ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы); 
	      
	      ОбластьПодвал.Параметры.Упаковка = стр.Серия.PhErpЗаводскаяКоробка;
	      ТабличныйДокумент.Вывести(ОбластьПодвал);
	      
	      ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	  КонецЦикла;
	  
	  Возврат ТабличныйДокумент;
	//+/Дмитрий@, 2024-10-31 01:16:30
	  
  КонецФункции // СформироватьПечатнуюФорму()
